app/Models/M_peminjaman.php

    public function read($id = FALSE) {
        if ($id === FALSE) {
            return $this->db->get('pinjambuku')->result_array();
---
SELECT *
FROM `pinjambuku`